import { Component } from '@angular/core';

@Component({
  selector: 'app-message',
  templateUrl: './message.component.html',
  styleUrls: ['./message.component.scss']
})
export class MessageComponent {
  public messages = [
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران',
      active: false
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
    { id:1,
      title: 'بازگشایی مرتبه دوم معاملاتی(کباده1)',
      img:'https://icongr.am/entypo/chevron-small-down.svg?size=16&color=999',
      desc: 'به اطلاع می‌رساند؛ نماد معاملاتی شرکت تهیه و تولید خاک نسوز استقلال آباده (کباده1) پس از افشای اطلاعات با اهمیت، ‌از طریق انجام حراج ناپیوسته بدون محدودیت دامنه نوسان قیمت و با اعمال یک مرحله پیش گشایش، امروز دوشنبه مورخ 1402/06/13 آماده انجام معامله می‌باشد. لازم به ذکر است پس از انجام حراج ناپیوسته و حذف سفارشات، انجام معاملات در نماد مذکور به صورت حراج پیوسته در دامنه مجاز قیمتی امکان‌پذیر است. مدیریت عملیات بازار فرابورس ایران'
    },
  ]
  public getSystemTime() {
    const now = new Date();
    const day = now.getDay(); // returns a number representing the day of the week, starting with 0 for Sunday
    const hours = now.getHours();
    const minutes = now.getMinutes();
    console.log(`Today is day ${day} and the time is ${hours}:${minutes}.`);
    return hours+ ':' +minutes
  }
}
